'''
problem3:
從標示混合的拿出一支筆就可以判斷了
舉例：
首先，標示混合的這袋一定是只裝原子筆或鉛筆
假設拿出來的是鉛筆，則代表標示混合的這袋只裝鉛筆
再來我們知道標示原子筆的那袋一定是只裝鉛筆或混合
但已知標示混合的這袋為只裝鉛筆
所以標示原子筆的那袋裝的是混合
而剩下的最後一袋標示鉛筆的那袋則裝的是原子筆
'''

'''
problem4:
題目：
有三個人一起到迪士尼遊玩,中午肚子餓了,去餐廳點了一份現在最夯的冰雪奇緣
雙人組,要價 900 元,付錢後,服務生發現今天套餐大特價,只要 750 元,因此
服務生應該退還 150 元給這三個人,但是這位服務生一時鬼迷心竅,決定暗槓 60
元,只退了 90 元給這三個遊客。
那麼:三人各出 300 元 - 服務生還給他們一人 30 元 = 三人各出 270 元。270
元 × 3 人+ 服務生私吞的 60 元 = 810 + 60 = 870 !? 怎麼不是 900 元呢?還
有 30 元去哪了呢?請用敘述的方式,儘量清楚解釋問題出在哪裡。

解釋：
810元是三個人總共付的錢，60元是服務生從他們付的錢裡面偷拿的錢，相減之後會得到應付的錢750元沒有錯。
此題目敘述有陷阱，不應該把810跟60相加，因為60是取自810。
'''